app/Controllers/Login.php

SELECT *
FROM `user`
WHERE `email` = 'samuel@gmail.com'
AND `user`.`deleted_at` IS NULL
 LIMIT 1
---
    public function do_login()
    {


        $userModel = new UserModel();

        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $result = $userModel->where('email', $email)->first();